#Напишите программу, которая принимает на стандартный вход список игр футбольных команд
#с результатом матча и выводит на стандартный вывод сводную таблицу результатов всех матчей.
#Спартак;9;Зенит;10
#Локомотив;12;Зенит;3
#итд
a = int(input())
c = {}
for i in range(a):
    d = input().split(';')#разбиваем строку
    for i in range(0,len(d),4):
        if d[i] not in c.keys():#есть ли команда в словаре
            c[d[i]]= [0,0,0,0,0]#матч, победа,ничья,пор,очки
        if d[i + 2] not in c.keys():
            c[d[i + 2]]= [0,0,0,0,0]
        if int(d[i + 1]) <  int(d[i + 3]):#первая команда проиграла
            c[d[i]][0] = c[d[i]][0] + 1
            c[d[i]][3] = c[d[i]][3] + 1
            c[d[i + 2]][0] = c[d[i + 2]][0] + 1
            c[d[i + 2]][1] = c[d[i + 2]][1] + 1
            c[d[i + 2]][4] = c[d[i + 2]][4] + 3
        elif int(d[i + 1]) ==  int(d[i + 3]):#ничья
            c[d[i]][0] = c[d[i]][0] + 1
            c[d[i]][2] = c[d[i]][2] + 1
            c[d[i]][4] = c[d[i]][4] + 1
            c[d[i + 2]][0] = c[d[i + 2]][0] + 1
            c[d[i + 2]][2] = c[d[i + 2]][2] + 1
            c[d[i + 2]][4] = c[d[i + 2]][4] + 3
        elif int(d[i + 1]) > int(d[i + 3]):#победа второй команды
            c[d[i]][0] = c[d[i]][0] + 1
            c[d[i]][1] = c[d[i]][1] + 1
            c[d[i]][4] = c[d[i]][4] + 3
            c[d[i + 2]][0] = c[d[i + 2]][0] + 1
            c[d[i + 2]][3] = c[d[i + 2]][3] + 1
for q, w in c.items():
    print((q+':'), *w, end='\n')# вывод должен быть в формате Локомотив:2 2 0 0 6